# 小明，小刚去超市里购买水果
# 小明购买了苹果，草莓，香蕉，小刚购买了葡萄，橘子，樱桃，
#请从下面的描述的字典中，计算每个人花费的金额，并写入到money字段里。
Friuts = {
	"苹果":12.3,  # 水果和单价
	"草莓":4.5,
       "香蕉":6.3,
       "葡萄":5.8,
       "橘子":6.4,
       "樱桃":15.8,
}
info = {
    '小明': {
        'fruits': {'苹果':4, '草莓':13, '香蕉':10},
        'money': {}
    },
    '小刚': {
        'fruits': {'葡萄':19, '橘子':12, '樱桃':30},
        'money': {}
    },
}
print("小明的购物情况如下：")
def print_info(can):
    for i in can:
        print(i,)
print_info(info)
chose1=input("请输入知道谁的购物清单：")